# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

some_list = ['some text', 44, 4.2, {4, 6, 9}, True, [5, 'gg']]
for el in some_list:
    print(f"Element \"{el}\" : Type \"{type(el)}\"")
