# Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
# Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый).
# Проверить работу примера, создав экземпляр и вызвав описанный метод.

import time
import itertools


class TrafficLight:
    __color = [["red", 7], ["yellow", 2], ["green", 5], ["yellow", 2]]

    def changing(self):
        for color in itertools.cycle(self.__color):
            print(f"\r{color[0]}", end='')
            time.sleep(color[1])


traffic = TrafficLight()
traffic.changing()
