# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def my_div(a, b):
    try:
        return a / b
    except ZeroDivisionError:
        print('Нельзя делить на ноль!')


def main():
    a = int(input('Введите первое число: '))
    b = int(input('Введите второе число: '))
    print(my_div(a, b))


main()
