# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными. Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
# толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.

class Road:

    def __init__(self, lenght, width):
        self._lenght = lenght
        self._width = width

    def road_mass(self):

        return f"{self._lenght} m * {self._width} m * 25kg * 5sm = {self._lenght * self._width * 25 * 5 / 1000} t"


some_road = Road(300, 20)
print(some_road.road_mass())
